---
kind: other
id: Properties.T:Autodesk.Revit.UI.RibbonButtonOptions
source: html/2e958b0f-ff4f-f857-d9aa-4404ba350bcb.htm
---
# RibbonButtonOptions Properties

Specifies whether the .NET object represents a valid Revit entity.